(function () {
	'use strict';

	angular
		.module('app', ['chart.js', 'ngMaterial', 'ui.router'])
		//.config(function ($stateProvider, $urlRouterProvider) {

		//	$urlRouterProvider.otherwise('/');

		//	$stateProvider
		//		.state('intro', {
		//			url: ('/intro'),
		//			templateUrl: 'intro.html',
		//			controller: 'controller'
		//		})
		//		.state('general', {
		//			url: ('/general'),
		//			templateUrl: 'general.html',
		//			controller: 'controller'
		//		})
		//})
        .controller('controller', ['$location', '$scope', '$http', '$timeout', '$mdSidenav', '$mdDialog', controller])



    function controller($location, $scope, $http, $timeout, $mdSidenav, $mdDialog) {
		var vm = this;
        vm.title = 'controller';

        //Initializing Data
		vm.data = {
			"company": {
				"businessType": "Υφιστάμενη Επιχείρηση",//na to svisw
				//"nuberOfCompletedYears": 7//epishs
			},
			"kads": [
				{}
			]
        };

        //Geo From db


        //Income Calculator for Incomes-Expenses.html
		$scope.vm = this;
		$scope.$watch("vm.data.incomes", function (n, o) {
			if (vm.data.incomes && n !== o) {
				vm.data.sumIncomesFirstYear = 0;
				vm.data.sumIncomesSecondYear = 0;
				vm.data.sumIncomesThirdYear = 0;
				for (var i = 0; i < vm.data.incomes.length; i++) {
					vm.data.incomes[i].incomesFirstYear = vm.data.incomes[i].value * vm.data.incomes[i].predictionFirst;
					vm.data.sumIncomesFirstYear += vm.data.incomes[i].incomesFirstYear;

					vm.data.incomes[i].incomesSecondYear = vm.data.incomes[i].value * vm.data.incomes[i].predictionSecond;
					vm.data.sumIncomesSecondYear += vm.data.incomes[i].incomesSecondYear;

					vm.data.incomes[i].incomesThirdYear = vm.data.incomes[i].value * vm.data.incomes[i].predictionThird;
					vm.data.sumIncomesThirdYear += vm.data.incomes[i].incomesThirdYear;

				}
			}
        }, true);
        $scope.$watch("vm.data.expenses", function (n, o) {
            if (vm.data.expenses && n !== o) {
                vm.data.sumExpensesFirstYear = 0;
                vm.data.sumExpensesSecondYear = 0;
                vm.data.sumExpensesThirdYear = 0;
                for (var i = 0; i < vm.data.expenses.length; i++) {
                    vm.data.sumExpensesFirstYear += vm.data.expenses[i].expensesFirst||0;

                    vm.data.sumExpensesSecondYear += vm.data.expenses[i].expensesSecond || 0;

                    vm.data.sumExpensesThirdYear += vm.data.expenses[i].expensesThird || 0;

                }
            }
        }, true);
        $scope.$watch("vm.total", function (n, o) {
            if (vm.total > 100) {
                vm.showAlert(27);
            }
        });

        //Alert Popup Window
		function debounce(func, wait, context) {
			var timer;

			return function debounced() {
				var context = $scope,
					args = Array.prototype.slice.call(arguments);
				$timeout.cancel(timer);
				timer = $timeout(function () {
					timer = undefined;
					func.apply(context, args);
				}, wait || 10);
			};
		}
		function buildDelayedToggler(navID) {
			return debounce(function () {
				// Component lookup should always be available since we are not using `ng-if`
				$mdSidenav(navID)
					.toggle()
			}, 200);
		}
		function buildToggler(navID) {
			return function () {
				// Component lookup should always be available since we are not using `ng-if`
				$mdSidenav(navID)
					.toggle()
			};
		}
		vm.close = function () {
			// Component lookup should always be available since we are not using `ng-if`
			$mdSidenav('left').close()
		};
		vm.status = '  ';
        vm.customFullscreen = false;
		vm.showAlert = function (pos) {
			alert = $mdDialog.alert({
				title: 'Βοηθεια',
				textContent: vm.helpers[pos],
				ok: 'Κλεισιμο'
			});

			$mdDialog
				.show(alert)
				.finally(function () {
					alert = undefined;
				});
		};

        //Active Sections
		vm.class = "";
		vm.activeSection = 1;
		vm.changeActive = function (id) {
			vm.activeSection = id;

		}

        //Menu toggle
		vm.toggleLeft = buildDelayedToggler('left');
		vm.toggleRight = buildToggler('right');
		vm.isOpenRight = function () {
			return $mdSidenav('right').isOpen();
		};
		vm.openLeftMenu = function () {
			$mdSidenav('right').toggle();
        };

        //ChartJS
		vm.chart = {
			labels: ["Download Sales", "In-Store Sales", "Mail-Order Sales"],
			data: [vm.data.incomesfirstYear, vm.data.incomessecondYear, vm.data.incomesthirdYear]
        }

        //General Function
		vm.add = function (Array, o) {
			if (!vm.data[Array]) vm.data[Array] = [];
			vm.data[Array].push(o || {});
		}
		vm.remove = function (Array, index) {
			Array.splice(index, 1);
		}
		vm.total = 0;
		vm.data.partners = []
		vm.getTotal = function () {
			vm.total = vm.data.partners.filter(function (c) {
				return c.percentage && (typeof c.percentage === "number");
			}).reduce(function (s, i) {
				return s + i.percentage;
                }, 0);
			return vm.total;
        }

		vm.checkAFM = function (a) {
			var iDigit = 0;
			var Num1 = 0;
			for (iDigit = 1; iDigit <= 8; iDigit++) {
				Num1 += parseInt(a.substr(iDigit - 1, 1)) * Math.pow(2, (9 - iDigit));
			}
			var res = Num1 % 11;
			if (res == 10) { res = 0; }
			var ok = (res == a.substr(a.length - 1, 1)) ? true : false;
			if (ok)
				vm.afmMess = "Έγκυρο ΑΦΜ";
			else
				vm.afmMess = " Το ΑΦΜ δεν είναι έγκυρο";
		}

        //Creates the rows for economicSituation.html Table
		vm.createRows = function (y, k) {
			vm.startYear = y - parseInt(k);
			vm.data.xronia = [];
			for (var i = parseInt(k); i > 0; i--)
				vm.data.xronia.push(y - i + 1);
			for (let x of vm.data.totals) {
				x.values = [];
				for (var i = 0; i < parseInt(k); i++) {
					x.values.push(null);
				}
            }
            if (vm.data.xronia.length >= 1) {
                vm.clicked = true;
            }
            else {
                vm.showAlert(28)
            }
        }

        //KAD
		var lastSearchKad = null;
		vm.kaad = null;
		vm.getKaad = function (search) {
			if (search && search != lastSearchKad) {
				$http.post("/home/GetKad", { keyword: search }).then(function (r) {
					vm.kaad = r.data;
					lastSearchKad = search;
				});
			}
		}
		vm.searchTimeout = null;
		vm.onSearchKad = function (search, i) {
			vm.tempIndex = i;
			if (vm.searchTimeout) $timeout.cancel(vm.searchTimeout);
			$timeout(function () {
				vm.getKaad(search);
			}, 500);

		}
		vm.selectKad = function (k, kad) {
			kad.title = k.title;
			kad.id = k.id;
			vm.kaad = null;
			vm.searchInput = null;
        }

        //Data
		vm.helpers = [
			"Σύντομο ιστορικό και στόχοι - όραμα της επιχείρησης / Εισαγωγή σχεικά με τη γέννηση της επιχειρηματικής ιδέας και του οράματος του/των δυνητικού/ων επιχειρηματία/ων (πχ. ποια είναι η επιχειρηματική ευκαιρία και ποιες ανάγκες της αγοράς καλύπτει)",
			"Σύντομη περιγραφή της υφιστάμενης ή μελλοντικής έδρας και τυχόν παραρτημάτων της επιχείρησης (λ.χ. περιγραφή των κτιριακών υποδομών, της γεωγραφικής περιοχής και των πλεονεκτημάτων της [π.χ. πυκνό συγκοινωνιακό δίκτυο, εγγύτητα με εμπορικό κέντρο, κλπ.])",
			"Περιγραφή του/των εταίρου / εταίρων (σπουδές, εμπειρία, τεχνογνωσία για να τεκμηριώνεται η συνάφεια με τις υπηρεσίες/παραγόμενα προϊόντα της επιχείρησης, ιστορικό τυχούσας προϋπάρχουσας συνεργασίας των εταίρων και ρόλος του κάθε εταίρου στην επιχείρηση. Αναφέρετε το υφιστάμενο ή μελλοντικό προσωπικό της επιχείρησης και τον ρόλο του στην Επιχείρηση. Τέλος αναφέρετε την κεφαλαιακή δομή και το οργανόγραμμα της εταιρίας",
			"Περιγράψτε αναλυτικά και με κατανοητό τρόπο τα προϊόντα/υπηρεσίες σας, τις ανάγκες που καλύπτουν, την ιδιαιτερότητα-πλεονεκτήματα τους σε σχέση με αυτά του ανταγωνισμού. Αναφέρετε εάν υπάρχουν τυχόν νέα προϊόντα / υπηρεσίες που πρόκειται να λανσάρετε στο άμεσο μέλλον και εάν έχετε εξασφαλίσει ήδη συμβάσεις / προσύμφωνα συνεργασίας με πελάτες για αυτά.",
			"Αναφέρετε στοιχεία και τάσεις της τοπικής, εθνικής και διεθνούς αγοράς (στην οποία στοχεύετε) σχετικά με τη ζήτηση και την κατανάλωση των προϊόντων/ υπηρεσιών της επιχείρησης (π.χ.ανοδική πορεία της κατανάλωσης των προϊόντων της επιχείρησης) αναφέροντας επίσημα στοιχεία (λ.χ.από ΕΛΣΤΑΤ και μελέτες έγκριτων οργανισμών, π.χ.ICAP) και τους υφιστάμενους – δυνητικούς πελάτες των προϊόντων / υπηρεσιών της επιχείρησης (λ.χ.επιχειρήσεις & οργανισμοί του Ιδιωτικού ή Δημοσίου Τομέα, ιδιώτες - τελικοί καταναλωτές).Αναφέρετε τα ιδιαίτερα χαρακτηριστικά π.χ.ηλικιακές ομάδες, φύλο, lifestyle, μορφωτικό και κοινωνικό επίπεδο, αγοραστική δύναμη, κλπ.των υφιστάμενων ή δυνητικών πελατών – καταναλωτών της επιχείρησης.Αναφέρετε τυχόν ιδιαίτερα χαρακτηριστικά π.χ.οικονομικός κλάδος, μέγεθος, αρ.εργαζομένων, κλπ.των υφιστάμενων ή δυνητικών πελατών – νομικών προσώπων της επιχείρησης.Τέλος, μπορείτε να αναφέρετε το μέγεθος των δυνητικών πελατών σας με βάση πραγματικά στοιχεία της τοπικής, εθνικής, διεθνούς αγοράς που τυχόν στοχεύετε.",
			"Αναφέρετε τους βασικούς ανταγωνιστές της επιχείρησης σε τοπικό, εθνικό και διεθνές επίπεδο (αναλόγως της / των αγορών στην οποία/ες στοχεύετε) και τυχόν ανταγωνιστικά πλεονεκτήματα των προϊόντων / υπηρεσιών της επιχείρησης σε σχέση με αυτά των ανταγωνιστών της",
			"Με βάση την ανάλυση του ανταγωνισμού, της αγοράς στόχου και των χαρακτηριστικών των δυνητικών πελατών σας και της ανάλυσης SWOT που προηγήθηκε αναφέρετε τους βασικούς στόχους σας στους οποίους θα βασιστούν οι ενέργειες marketing. Κατόπιν αναφέρετε με ποιες ενέργειες θα επιδιώξετε την επίτευξη των στόχων αυτών, λ.χ. μέσω της υλοποίησης ραδιοφωνικής καμπάνιας, της δημιουργίας ιστοσελίδας και της υλοποίησης καμπάνιας στα social media. Επίσης, αναφέρετε εάν διαθέτει ή πρόκειται να διαθέτει η επιχείρηση Εμπορικό Σήμα? Επίσης, αναφέρετε εάν η επιχείρηση προβάλει ή πρόκειται να προβάλλει τα προϊόντα / υπηρεσίες της οργανωμένα σε επαγγελματικούς οδηγούς, μηχανές αναζήτησης, κ.α.",
			"Σύμφωνα με τον Kotler «Τοποθέτηση είναι η διαδικασία σχεδιασμού της εταιρικής προσφοράς και εικόνας έτσι ώστε να κατακτήσει η μάρκα ένα ξεχωριστό μέρος στο μυαλό του κοινού- στόχος. Το τελικό αποτέλεσμα της τοποθέτησης είναι η επιτυχημένη δημιουργία μιας πελατοκεντρικής πρότασης αξίας (proposition value), μιας συγκεκριμένης αιτίας να αγοράσει το κοινό- στόχος το προϊόν». http://ba.uom.gr/mkt/eap/Andro/OSS-1/1h_OSS/6-Positioning.pdf. Στο σημείο αυτό αναφέρετε την «δήλωση τοποθέτησης – positioning statement» της επιχείρησής σας, η οποία προσδιορίζει το σημαντικότερο ανταγωνιστικό της πλεονέκτημα σε σχέση με τον ανταγωνισμό.",
			"Στο σημείο αυτό αναφέρετε ποια θα είναι η στρατηγική και τα κανάλια διανομής των προϊόντων / υπηρεσιών σας. Με βάση τα χαρακτηριστικά και τις καταναλωτικές συνήθειες των δυνητικών αγοραστών των προϊόντων / υπηρεσιών σας αναφέρετε εάν θα πουλάτε τα προϊόντα / υπηρεσίες σας απευθείας στους πελάτες σας ή μέσω τρίτων (λ.χ. εμπόρων λιανικής, εμπορικών αντιπροσώπων, franchisees, κλπ.) ή εάν θα ακολουθήσετε ένα μεικτό τρόπο διανομής συνδυάζοντας περισσότερα από ένα κανάλια. Είναι σύνηθες οι επιχειρήσεις να αξιοποιούν περισσότερα από ένα κανάλια διανομής λ.χ. ηλεκτρονικές πωλήσεις μέσω της εταιρικής ιστοσελίδας, πωλήσεις μέσω καταστήματος και συνεργασία με άλλα καταστήματα λιανικής πώλησης εγκατεστημένα σε άλλες γεωγραφικές περιοχές, κλπ.",
			"Αναφέρετε τις προγραμματισμένες επενδύσεις της επιχείρησης για το άμεσο μέλλον (εντός του επόμενου 12μηνου) οι οποίες σχετίζονται με τον αναπτυξιακό της σχεδιασμό. Λ.χ. στην περίπτωση που σχεδιάζετε να λανσάρετε ένα νέο καινοτόμο προϊόν αναφέρετε τις δαπάνες και τις επενδύσεις που θέλετε να κάνετε και σχετίζονται με αυτό το προϊόν",
			"Αναφέρετε εάν η εταιρία ή ο (δυνητικός) επιχειρηματίας διαθέτει κάποια διεθνή / ευρωπαϊκή / εθνική πατέντα ή κάποια πατέντα υπό έκδοση για κάποιο/α προϊόν/υπηρεσία. Αναφέρετε εάν η επιχείρηση αξιοποιεί ή πρόκειται να υιοθετήσει αυτόματα συστήματα παραγγελιοληψίας (remote, κ.α.), εξειδικευμένα Λογισμικά (ERP, CRM, Logistics, κ.α.) ή/ και ηλεκτρονικές πωλήσεις. Αναφέρετε εάν η εταιρία ή ο (δυνητικός) επιχειρηματίας έχει βραβευτεί σε κάποιον Ευρωπαϊκό ή διεθνή διαγωνισμό. Αναφέρετε εάν η εταιρία ή ο (δυνητικός) επιχειρηματίας έχει απλώς συμμετάσχει σε Ευρωπαϊκό ή διεθνή διαγωνισμό.",
			"Αναφέρετε εάν η εταιρία διαθέτει ή πρόκειται να διαθέτει συστήματα ή υποδομές προσβασιμότητας από ΑΜΕΑ",
			"Νεκρό σημείο: είναι το ποσό εκείνο των πωλήσεων (κύκλου εργασιών), με το οποίο μια επιχείρηση καλύπτει ακριβώς τόσο τα σταθερά όσο και τα μεταβλητά της έξοδα, χωρίς να πραγματοποιεί ούτε κέρδος ούτε ζημιά. Η βασική αρχή, πάνω στην οποία στηρίζεται η ανάλυση του «νεκρού σημείου» (break even point), είναι η συμπεριφορά του κόστους.Αυτό συμβαίνει γιατί ένα μέρος του κόστους είναι μεταβλητό και ανάλογο των πωλήσεων, ενώ ένα άλλο είναι σταθερό, τουλάχιστον για ένα μεγάλο εύρος πωλήσεων.",
			"Οι σταθερές δαπάνες αποτελούνται από τις δαπάνες εκείνες που παραμένουν αμετάβλητες και ανεξάρτητες από το ύψος των πωλήσεων. Τέτοιες δαπάνες αποτελούν τα έξοδα διοικήσεως, οι αποσβέσεις, τα ενοίκια γραφείων μηχανών, τα χρηματοοικονομικά έξοδα κ.λ.π.Ωστόσο, οι σταθερές δαπάνες μπορεί να μεταβάλλονται, αλλά η μεταβολή τους να οφείλεται σε άλλες αιτίες ανεξάρτητες από το μέγεθος της δραστηριότητας της επιχείρησης.Επίσης, είναι δυνατόν ορισμένες δαπάνες να παραμένουν σταθερές μέχρι ενός ορισμένου ύψους πωλήσεων, πέραν του οποίου απαιτούνται πρόσθετες δαπάνες.",
			"Οι μεταβλητές δαπάνες είναι ανάλογες προς το ύψος των πωλήσεων ή του κύκλου εργασιών μιας επιχείρησης και τέτοιες είναι οι αμοιβές προσωπικού, οι υπερωρίες κ.α.",
			"O φορολογικός νόμος, ορίζοντας σαν βάση της φορολογίας το έτος, εννοεί εκείνο που στη λογιστική πρακτική καλείται «διαχείριση» ή «χρήση», δηλαδή, το χρονικό διάστημα που περικλείεται ανάμεσα σε δύο διαδοχικές απογραφές (ή ισολογισμούς), το οποίο, κατά κανόνα, είναι ετήσιο, ακριβώς δε, αυτής της ετήσιας περιόδου τα κέρδη προτίθεται να φορολογήσει. Η διαχειριστική χρήση δεν μπορεί να περιλαμβάνει περισσότερους από δώδεκα (12) μήνες. Σε εξαιρετικές περιπτώσεις, η πρώτη διαχειριστική χρήση μπορεί να ορίζεται για χρονικό διάστημα μέχρι είκοσι τέσσερις (24) μήνες.",
			"Ο ορισμός των ΜΜΕ κάνει διάκριση μεταξύ τριών διαφορετικών κατηγοριών επιχειρήσεων. Κάθε κατηγορία αντιστοιχεί σε ένα είδος σχέσης που η επιχείρηση θα μπορούσε να έχει με μια άλλη επιχείρηση. Αυτή η διάκριση είναι αναγκαία προκειμένου να υπάρχει σαφής εικόνα της οικονομικής κατάστασης της επιχείρησης και να αποκλείει εκείνες που δεν είναι πραγματικά ΜΜΕ. Οι κατηγορίες είναι: α / Αυτόνομη επιχείρηση: αν η επιχείρηση είναι είτε πλήρως ανεξάρτητη είτε έχει μία ή περισσότερες μειοψηφικές εταιρικές σχέσεις (σε ποσοστό μικρότερο του 25 % η καθεμιά) με άλλες επιχειρήσεις. β / Συνεργαζόμενη επιχείρηση: αν η εταιρική συμμετοχή σε άλλες επιχειρήσεις ανέρχεται σε τουλάχιστον 25 % αλλά όχι παραπάνω από 50 %, η σχέση θεωρείται ότι υφίσταται μεταξύ συνεργαζόμενων επιχειρήσεων. γ / Συνδεδεμένη επιχείρηση: εάν η εταιρική συμμετοχή σε άλλες επιχειρήσεις ξεπερνά το όριο του 50 %, αυτές θεωρούνται ",
			"Τα πεδία στα δεξιά συμπληρώνονται σύμφωνα με τις αντίστοιχες καταχωρήσεις από τον Ισολογισμό και την Κατάσταση Αποτελεσμάτων Χρήσης της επιχείρησης (ΚΑΧ) για κάθε έτος σε περίπτωση εταιρίας με βιβλία Γ΄τάξης. Σε περίπτωση βιβλίων Β΄τάξης συμπληρώστε μόνο τα πεδία που αντιστοιχούν στην επιχείρηση σας βάσει του Ε3. Σε κάθε περίπτωση αν κάποιο πεδίο δεν απαιτείται για την επιχείρηση σας, συμπληρώστε το σύμβολο « - » ή αφήστε το κενό.",
			"Ο δείκτης αυτός είναι σημαντικός διότι παρέχει ένα μέτρο αξιολόγησης της αποδοτικότητας της επιχείρησης. Μια επιχείρηση θεωρείται επιτυχημένη, όταν έχει μεγάλο καθαρό μικτό κέρδος σε σχέση με τις πωλήσεις και τα ίδια κεφάλαια που απασχολεί",
			"Ο δείκτης αυτός είναι σημαντικός διότι παρέχει ένα μέτρο αξιολόγησης της αποδοτικότητας τους. Μια επιχείρηση θεωρείται επιτυχημένη, όταν έχει μεγάλο ποσοστό μικτού κέρδους, που να της επιτρέπει να καλύπτει τα λειτουργικά και άλλα έξοδα της και συγχρόνως της αφήνει ικανοποιητικό καθαρό κέρδος σε σχέση με τις πωλήσεις και τα ίδια κεφάλαια που απασχολεί.Ένας υψηλός δείκτης δείχνει την ικανότητα της διοίκησης να επιτυγχάνει φθηνές αγορές και να πουλάει σε υψηλές τιμές ενώ ένας χαμηλός δείκτης δείχνει το αντίθετο.",
			"Ο δείκτης αυτός δείχνει την σχέση του κόστους των πωληθέντων προϊόντων ή εμπορευμάτων με τις πωλήσεις , και μετρά την αποτελεσματικότητα ελέγχου του κόστους πωληθέντων.",
			"Ο δείκτης αυτός εκτιμά την εντατικότητα με την οποία χρησιμοποιεί η επιχείρηση τα περιουσιακά της στοιχεία για να επιτύχει τους στόχους πωλήσεων της.Ένας υψηλός δείκτης εκμετάλλευσης ενεργητικού σημαίνει ότι η επιχείρηση χρησιμοποιεί εντατικά τα περιουσιακάτης στοιχεία προκειμένου να πραγματοποιεί τις πωλήσεις της.Ένας χαμηλός δείκτης αποτελεί ένδειξη όχι εντατικής χρησιμοποίησης των περιουσιακών της στοιχείων.Ο δείκτηςαυτός στην ουσία μας δείχνει εάν υπάρχει υπερεπένδυση κεφαλαίων στην επιχείρηση σε σχέση με το ύψος των πωλήσεων της.",
			"Ο αριθμοδείκτης αυτός δείχνει το μέτρο ρευστότητας μιας επιχείρησης και το περιθώριο ασφαλείας, ώστε αυτή να είναι σε θέση να ανταποκριθεί στην πληρωμή των καθημερινών απαιτητών υποχρεώσεων. Οσο πιο προβλέψιμες είναι οι εισροές χρημάτων μιας επιχείρησης τόσο είναι γενικότερα αποδεκτός ένας πιο χαμηλός δείκτης, αν και αυτό είναι συνάρτηση κυρίως του κλάδου στον οποίο ανήκει η επιχείρηση.",
			"Ο συγκεκριμένος δείκτης καταδεικνύει αν οι απαιτήσεις μιας επιχείρησης είναι πολύ μεγάλες σε σύγκριση με τις πωλήσεις της. Ανάλογος με την ταχύτητα είσπραξης των απαιτήσεων είναι ο χρόνος δέσμευσης των απαιτήσεων. Μεγάλη ταχύτητα στην είσπραξη των απαιτήσεων σημαίνει μικρότερη πιθανότητα ζημιών από επισφαλείς πελάτες. Η παρακολούθηση της τάσης είναι διαχρονικά χρήσιμη για την αξιολόγηση της ποιότητας και της ρευστότητας των απαιτήσεων.",
			"Με τον εν λόγω δείκτη παρατηρούμε την επίδραση που ασκεί η χρησιμοποίηση των δανειακών κεφαλαίων στην αποδοτικότητα των ιδίων κεφαλαίων της εταιρείας. Ανάλογα με το επίπεδο του δείκτη ­ μεγαλύτερος, ίσος ή μικρότερος της μονάδας ­ η επίδραση από τη χρήση ξένων κεφαλαίων στα κέρδη της επιχεόρησης είναι αντίστοιχα θετική και επωφελής, μηδενική ή αρνητική.",
			"Ο αριθμοδείκτης αυτός απεικονίζει την κερδοφόρα δυναμικότητα μιας επιχείρησης και παρέχει ένδειξη του κατά πόσο επιτεύχθηκε ο στόχος πραγματοποίησης ενός ικανοποιητικού αποτελέσματος από τη χρήση των κεφαλαίων του μετόχου. Με άλλα λόγια, μετρά την αποτελεσματικότητα με την οποία τα κεφάλαια των φορέων της επιχείρησης απασχολούνται σε αυτήν. Αποτελεί τον βασικό δείκτη τον οποίο η διοίκηση μιας εταιρείας σε περίπτωση θετικού αποτελέσματος τείνει να προβάλει με τον πιο επιφανή τρόπο στον ετήσιο απολογισμό χρήσης.",
            "Ο συγκεκριμένος αριθμοδείκτης μετράει την απόδοση των συνολικών περιουσιακών στοιχείων μιας επιχείρησης και επιτρέπει την αξιολόγηση της αποτελεσματικότητας της λειτουργίας της. Ο δείκτης φανερώνει την ικανότητά της να μπορεί να επιζήσει οικονομικά και να προσελκύσει κεφάλαια που προσφέρονται για επένδυση, «ανταμείβοντάς» τα ανάλογα.",
            "Το ποσοστό των μετόχων δεν μπορεί να υπερβαίνει το 100%.",
            "Δεν έχετε εισάγει Έτος ή Αριθμό Κλεισμένων Διαχειρηστικών Χρήσεων στα Γενικα Στοιχεία Επιχείρησης"
		];
		vm.educationLevel = ["Phd", "MSc", "Τριτοβάθμια", "Δευτεροβάθμια", "Υποχρεωτική"]
		vm.specialty = ["Διοικητικό Προσωπικού","Υπάλληλος Μηχανογράφησης","Υπάλληλος Λογιστηρίου","Υπάλληλος Αποθήκης","Υπάλληλος Παραγωγής / Ποιότητας και Διανομής","Εξωτερικός Συνεργάτης","Εξειδικευμένο Στέλεχος","Άλλο"]
		vm.partnerType = ["ΦΥΣΙΚΟ ΠΡΟΣΩΠΟ", "ΝΟΜΙΚΟ ΠΡΟΣΩΠΟ"];
		vm.sections = [
			{
				id: 1,
				src: "intro.html",
				desc: "ΕΠΙΧΕΙΡΗΜΑΤΙΚΟ ΣΧΕΔΙΟ"
			},
			{
				id: 2,
				src: "general.html",
				desc: "ΓΕΝΙΚΑ ΣΤΟΙΧΕΙΑ ΕΠΙΧΕΙΡΗΣΗΣ"
			},
			{
				id: 3,
				src: "companyId.html",
				desc: "ΣΤΟΙΧΕΙΑ ΤΑΥΤΟΤΗΤΑΣ ΕΠΙΧΕΙΡΗΣΗΣ"
			},
			{
				id: 4,
				src: "owner.html",
				desc: "ΣΤΟΙΧΕΙΑ ΕΚΠΡΟΣΩΠΟΥ"
			},
			{
				id: 5,
				src: "kad.html",
				desc: "ΚΩΔΙΚΟΙ ΑΡΙΘΜΟΙ ΔΡΑΣΤΗΡΙΟΤΗΤΩΝ"
			},
			{
				id: 6,
				src: "partners.html",
				desc: "ΣΤΟΙΧΕΙΑ ΕΤΑΙΡΩΝ/ΜΕΤΟΧΩΝ"
			},
			{
				id: 7,
				src: "basic_info.html",
				desc: "ΠΕΡΙΓΡΑΦΗ ΤΗΣ ΕΠΙΧΕΙΡΗΣΗΣ"
			},
			{
				id: 8,
				src: "marketing.html",
				desc: "ΔΙΑΦΗΜΙΣΗ ΚΑΙ MARKETING"
			},
			{
				id: 9,
				src: "economicSituation.html",
                desc: "ΑΝΑΛΥΣΗ ΟΙΚΟΝΟΜΙΚΗΣ ΚΑΤΑΣΤΑΣΗΣ",
                isDisabled: function () {
                    return vm.data.company.businessType == 'Επιχείρηση Υπό Σύσταση';
                }
			},
			{
				id: 10,
				src: "incomes_expenses.html",
                desc: "ΑΝΑΛΥΣΗ ΣΕ ΒΑΘΟΣ ΤΡΙΕΤΙΑΣ",
                isDisabled: function () {
                    return vm.data.company.businessType == 'Επιχείρηση Υπό Σύσταση';
                }
			},
			{
				id: 11,
				src: "deadspot.html",
				desc: "ΥΠΟΛΟΓΙΣΜΟΣ ΝΕΚΡΟΥ ΣΗΜΕΙΟΥ"
			}
        ]
        
		vm.doy = ["Α΄ ΑΘΗΝΩΝ", "Α΄ ΘΕΣΣΑΛΟΝΙΚΗΣ", "Α΄ ΛΑΡΙΣΑΣ", "Α΄ ΠΑΤΡΩΝ", "Α΄ ΠΕΡΙΣΤΕΡΙΟΥ", "Α΄ΠΕΙΡΑΙΑ", "ΑΓΙΟΥ ΔΗΜΗΤΡΙΟΥ", "ΑΓΙΟΥ ΝΙΚΟΛΑΟΥ", "ΑΓΙΩΝ ΑΝΑΡΓΥΡΩΝ", "ΑΓΡΙΝΙΟΥ", "ΑΙΓΑΛΕΩ", "ΑΙΓΙΟΥ", "ΑΛΕΞΑΝΔΡΟΥΠΟΛΗΣ", "ΑΜΑΛΙΑΔΑΣ", "ΑΜΑΡΟΥΣΙΟΥ", "ΑΜΠΕΛΟΚΗΠΩΝ", "ΑΜΦΙΣΣΑΣ", "ΑΡΓΟΣΤΟΛΙΟΥ", "ΑΡΓΟΥΣ", "ΑΡΤΑΣ", "ΑΧΑΡΝΩΝ", "Β΄ ΠΕΡΙΣΤΕΡΙΟΥ", "Β΄ΛΑΡΙΣΑΣ", "ΒΕΡΟΙΑΣ", "ΒΟΛΟΥ", "ΒΥΡΩΝΟΣ", "Γ΄ ΠΑΤΡΩΝ", "Γ΄ ΠΕΙΡΑΙΑ", "ΓΑΛΑΤΣΙΟΥ", "ΓΙΑΝΝΙΤΣΩΝ", "ΓΛΥΦΑΔΑΣ", "ΓΡΕΒΕΝΩΝ", "Δ΄ ΑΘΗΝΩΝ", "Δ΄ ΘΕΣΣΑΛΟΝΙΚΗΣ", "Δ΄ ΠΕΙΡΑΙΑ", "ΔΡΑΜΑΣ", "Ε΄ ΘΕΣΣΑΛΟΝΙΚΗΣ", "Ε΄ ΠΕΙΡΑΙΑ", "ΕΔΕΣΣΑΣ", "ΕΛΕΥΣΙΝΑΣ", "Ζ΄ ΘΕΣΣΑΛΟΝΙΚΗΣ", "ΖΑΚΥΝΘΟΥ", "Η΄ ΘΕΣΣΑΛΟΝΙΚΗΣ", "ΗΓΟΥΜΕΝΙΤΣΑΣ", "ΗΛΙΟΥΠΟΛΗΣ", "ΗΡΑΚΛΕΙΟΥ", "ΘΗΒΩΝ", "ΘΗΡΑΣ", "ΙΒ΄ ΑΘΗΝΩΝ", "ΙΓ΄ ΑΘΗΝΩΝ", "ΙΔ΄ ΑΘΗΝΩΝ", "ΙΖ ΑΘΗΝΩΝ", "ΙΩΑΝΝΙΝΩΝ", "ΙΩΝΙΑΣ ΘΕΣΣΑΛΟΝΙΚΗΣ", "ΚΑΒΑΛΑΣ", "ΚΑΛΑΜΑΡΙΑΣ", "ΚΑΛΑΜΑΤΑΣ", "ΚΑΛΛΙΘΕΑΣ", "ΚΑΡΔΙΤΣΑΣ", "ΚΑΡΠΕΝΗΣΙΟΥ", "ΚΑΣΤΟΡΙΑΣ", "ΚΑΤΕΡΙΝΗΣ", "ΚΑΤΟΙΚΩΝ ΕΞΩΤΕΡΙΚΟΥ", "ΚΕΝΤΡΟ ΕΛΕΓΧΟΥ ΜΕΓΑΛΩΝ ΕΠΙΧΕΙΡΗΣΕΩΝ", "ΚΕΡΚΥΡΑΣ", "ΚΗΦΙΣΙΑΣ", "ΚΙΛΚΙΣ", "ΚΟΖΑΝΗΣ", "ΚΟΜΟΤΗΝΗΣ", "ΚΟΡΙΝΘΟΥ", "ΚΟΡΩΠΙΟΥ", "ΚΥΜΗΣ", "ΚΩ", "ΛΑΓΚΑΔΑ", "ΛΑΜΙΑΣ", "ΛΕΥΚΑΔΑΣ", "ΛΙΒΑΔΕΙΑΣ", "ΜΕΣΟΛΟΓΓΙΟΥ", "ΜΟΣΧΑΤΟΥ", "ΜΥΚΟΝΟΥ", "ΜΥΤΙΛΗΝΗΣ", "Ν.ΗΡΑΚΛΕΙΟΥ", "Ν.ΙΩΝΙΑΣ ΒΟΛΟΥ", "ΝΑΞΟΥ", "ΝΑΥΠΛΙΟΥ", "ΝΕΑΣ ΙΩΝΙΑΣ", "ΝΕΑΣ ΣΜΥΡΝΗΣ", "ΝΕΩΝ ΜΟΥΔΑΝΙΩΝ", "ΝΙΚΑΙΑΣ", "ΞΑΝΘΗΣ", "ΟΡΕΣΤΙΑΔΑΣ", "ΠΑΛΑΙΟΥ ΦΑΛΗΡΟΥ", "ΠΑΛΛΗΝΗΣ", "ΠΑΡΟΥ", "ΠΛΟΙΩΝ ΠΕΙΡΑΙΑ", "ΠΟΛΥΓΥΡΟΥ", "ΠΡΕΒΕΖΑΣ", "ΠΤΟΛΕΜΑΙΔΑΣ", "ΠΥΡΓΟΥ", "ΡΕΘΥΜΝΟΥ", "ΡΟΔΟΥ", "ΣΑΜΟΥ", "ΣΕΡΡΩΝ", "ΣΠΑΡΤΗΣ", "ΣΤ΄ ΑΘΗΝΩΝ", "ΣΤ΄ ΘΕΣΣΑΛΟΝΙΚΗΣ", "ΣΥΡΟΥ", "ΤΡΙΚΑΛΩΝ", "ΤΡΙΠΟΛΗΣ", "ΥΠΗΡΕΣΙΑ ΕΣΩΤΕΡΙΚΗΣ ΕΠΑΝΕΞΕΤΑΣΗΣ", "Φ.Α.Ε.ΑΘΗΝΩΝ", "ΦΑΕ ΘΕΣΣΑΛΟΝΙΚΗΣ", "ΦΑΕ ΠΕΙΡΑΙΑ", "ΦΛΩΡΙΝΑΣ", "ΧΑΛΑΝΔΡΙΟΥ", "ΧΑΛΚΙΔΑΣ", "ΧΑΝΙΩΝ", "ΧΙΟΥ", "ΧΟΛΑΡΓΟΥ", "ΨΥΧΙΚΟΥ"]
		vm.companySize = ["Πολύ Μικρή", "Μικρή", "Μεσαία", "Μεγάλη"]
		vm.businessTypes = ["Επιχείρηση Υπό Σύσταση", "Υφιστάμενη Επιχείρηση"];
		vm.legalForms = ["Ατομική", "ΙΚΕ", "Ο.Ε.", "Ε.Ε.", "Α.Ε.", "ΕΠΕ", "Μη Κερδοσκοπική Επιχείρηση", "Κοινωνική Επιχείρηση", "Συνεταιρισμός", "Άλλο"];
		vm.contents = ["ΓΕΝΙΚΑ ΣΤΟΙΧΕΙΑ ΕΠΙΧΕΙΡΗΣΗΣ", "ΣΤΟΙΧΕΙΑ ΤΑΥΤΟΤΗΤΑΣ ΕΠΙΧΕΙΡΗΣΗΣ", "ΣΤΟΙΧΕΙΑ ΝΟΜΙΜΟΥ ΕΚΠΡΟΣΩΠΟΥ – ΣΤΟΙΧΕΙΑ ΔΥΝΗΤΙΚΟΥ ΕΠΙΧΕΙΡΗΜΑΤΙΑ", "ΚΩΔΙΚΟΙ ΑΡΙΘΜΟΙ ΔΡΑΣΤΗΡΙΟΤΗΤΩΝ (Κ.Α.Δ.) ΤΗΣ ΕΠΙΧΕΙΡΗΣΗΣ", "ΚΩΔΙΚΟΙ ΑΡΙΘΜΟΙ ΔΡΑΣΤΗΡΙΟΤΗΤΩΝ (Κ.Α.Δ.) ΤΗΣ ΥΠΟ ΣΥΣΤΑΣΗ ΕΠΙΧΕΙΡΗΣΗ", "ΣΤΟΙΧΕΙΑ ΕΤΑΙΡΩΝ/ΜΕΤΟΧΩΝ", "ΠΕΡΙΓΡΑΦΗ ΤΗΣ ΕΠΙΧΕΙΡΗΣΗΣ", "ΒΑΣΙΚΑ ΣΤΟΙΧΕΙΑ", "ΕΔΡΑ ΤΗΣ ΕΠΙΧΕΙΡΗΣΗΣ", "ΜΕΤΟΧΙΚΗ ΣΥΝΘΕΣΗ ΚΑΙ ΠΡΟΣΩΠΙΚΟ", "ΠΕΡΙΓΡΑΦΗ ΠΑΡΑΓΟΜΕΝΩΝ ΠΡΟΪΟΝΤΩΝ /ΥΠΗΡΕΣΙΩΝ", "ΣΥΝΟΠΤΙΚΗ ΠΑΡΟΥΣΙΑΣΗ ΤΗΣ ΠΑΡΑΓΩΓΙΚΗΣ ΔΙΑΔΙΚΑΣΙΑΣ", "Η ΑΓΟΡΑ ΣΤΟΧΟΣ", "ΑΝΑΛΥΣΗ ΑΝΤΑΓΩΝΙΣΜΟΥ", "ΑΝΑΛΥΣΗ SWOT", "ΣΧΕΔΙΑΖΟΜΕΝΕΣ ΕΝΕΡΓΕΙΕΣ ΔΙΑΦΗΜΙΣΗΣ ΚΑΙ MARKETING", "ΠΡΟΓΡΑΜΜΑΤΙΣΜΕΝΕΣ ΕΠΕΝΔΥΣΕΙΣ / ΔΑΠΑΝΕΣ ΤΗΣ ΕΠΙΧΕΙΡΗΣΗΣ ΠΟΥ ΣΧΕΤΙΖΟΝΤΑΙ ΜΕ ΤΟΥΣ ΣΤΟΧΟΥΣ ΚΑΙ ΤΟΝ ΑΝΑΠΤΥΞΙΑΚΟ ΣΧΕΔΙΑΣΜΟ ΤΗΣ", "ΚΑΙΝΟΤΟΜΙΕΣ ΠΟΥ ΔΙΑΘΕΤΕΙ Η ΕΠΙΧΕΙΡΗΣΗ", "ΠΡΑΣΙΝΕΣ ΔΙΑΔΙΚΑΣΙΕΣ ΚΑΙ ΠΟΛΙΤΙΚΕΣ ΠΟΥ ΕΧΟΥΝ ΤΥΧΟΝ ΥΙΟΘΕΤΗΘΕΙ Η ΠΡΟΚΕΙΤΑΙ ΝΑ ΥΙΟΘΕΤΗΘΟΥΝ", "ΥΠΟΔΟΜΕΣ – ΕΞΟΠΛΙΣΜΟΣ ΠΟΥ ΕΞΑΣΦΑΛΙΖΕΙ ΤΗΝ ΠΡΟΣΒΑΣΙΜΟΤΗΤΑ ΤΩΝ ΑΜΕΑ", "ΑΝΑΛΥΣΗ ΥΦΙΣΤΑΜΕΝΗΣ ΟΙΚΟΝΟΜΙΚΗΣ ΚΑΤΑΣΤΑΣΗΣ", "ΑΝΑΛΥΣΗ ΠΩΛΗΣΕΩΝ-ΕΣΟΔΩΝ ΚΑΙ ΕΞΟΔΩΝ ΣΕ ΒΑΘΟΣ ΤΡΙΕΤΙΑΣ", "ΥΠΟΛΟΓΙΣΜΟΣ ΝΕΚΡΟΥ ΣΗΜΕΙΟΥ", "Σύντομο Επιχειρηματικό Σχέδιο – Elevator Pitch"];
		vm.books = ["Β κατηγορίας", "Γ κατηγορίας"];
		vm.katDapanes = [
			{ name: "Κτιριακές δαπάνες", values: ["Αγορά", "Κτιριακές Παρεμβάσεις"] },
			{ name: "Εξοπλισμός", values: ["Μηχανολογικός εξοπλισμός / άλλος παραγωγικός εξοπλισμός", "Hardware - Software", "Εξοπλισμός γραφείου (π.χ. φωτοτυπικό μηχάνημα, τηλεφ. κέντρο, κλπ.)", "Έπιπλα γραφείου", "Άλλο"] },
			{ name: "Μισθοδοσία", values: ["Κόστος πωληθέντων "] },
			{ name: "Λειτουργικές δαπάνες", values: ["Ενοίκιο", "Ασφαλιστικές εισφορές επιχειρηματία", "Δαπάνες ηλεκτρισμού", "Δαπάνες ύδρευσης", "Δαπάνες σταθερής & κινητής τηλεφωνίας", "Δαπάνες κοινοχρήστων", "Δαπάνες θέρμανσης", "Άλλο"] },
			{ name: "Δαπάνες για αμοιβές τρίτων ", values: ["Λογιστική υποστήριξη", "Εκπαίδευση προσωπικού", "Νομική υποστήριξη", "Συμβουλευτική υποστήριξη", "Υπηρεσίες καθαριότητας", "Υπηρεσίες φύλαξης", "Άλλο"] },
			{ name: "Δαπάνες προβολής και δικτύωσης", values: ["Διαφημιστικά έντυπα", "Επαγγελματικές κάρτες", "Δημιουργία, φιλοξενία και συντήρηση εταιρικής ιστοσελίδας", "Προβολή στα Social Media ", "Διαφήμιση στο Internet", "Διαφήμιση στο ραδιόφωνο", "Διαφήμιση στην τηλεόραση", "Συμμετοχή σε εκθέσεις", "Άλλο"] },
			{ name: "Μεταφορικά μέσα", values: [] },
			{ name: "Αναλώσιμα", values: ["Γραφική ύλη", "Είδη καθαριότητας", "Άλλο"] },
			{ name: "Άλλα έξοδα", values: ["Έξοδα επαγγελματικών ταξιδιών του προσωπικού", "Άλλο"] },
		]
		vm.data.totals = [
			{ title: 'Συνολικός Κύκλος Εργασιών (ΣΕ €)', values: [] },
			{ title: 'Σύνολο Ενεργητικού', values: [] },
			{ title: 'Κέρδη Προ Φόρων και Αποσβέσεων', values: [] },
			{ title: 'Καθαρά Κέρδη', values: [] },
			{ title: 'Κόστος Πωληθέντων', values: [] },
			{ title: 'Ξένα Κεφάλαια', values: [] },
			{ title: 'Ίδια Κεφάλαια', values: [] },
			{ title: 'Απαιτήσεις', values: [] },
			{ title: 'Διαθέσιμα', values: [] },
			{ title: 'Βραχυπρόθεσμες Υποχρεώσεις', values: [] },
			{ title: 'Κυκλοφορού Ενεργητικό', values: [] },
			{ title: 'Μικτά Κέρδη(€)', hint: 18, values: [], formula: function (i) { return vm.data.totals[0].values[i] - vm.data.totals[4].values[i] } },
			{ title: 'Δείκτης Μικτού Κέρδους(%)', hint: 19, values: [], formula: function (i) { return (vm.data.totals[0].values[i] + vm.data.totals[4].values[i]) / vm.data.totals[0].values[i] } },
			{ title: 'Κόστος Πωληθέντων(%)', hint: 20, values: [], formula: function (i) { return vm.data.totals[4].values[i] / vm.data.totals[0].values[i] } },
			{ title: 'Δείκτης ταχύτητας κυκλοφορίας ενεργητικού', hint: 21, values: [], formula: function (i) { return vm.data.totals[0].values[i] / vm.data.totals[1].values[i] } },
			{ title: 'Δείκτης γενικής ρευστότητας:', hint: 22, values: [], formula: function (i) { return vm.data.totals[10].values[i] / vm.data.totals[9].values[i] } },
			{ title: 'Δείκτης ταχύτητας είσπραξης απαιτήσεων', hint: 23, values: [], formula: function (i) { return vm.data.totals[0].values[i] / vm.data.totals[7].values[i] } },
			{ title: 'Δείκτης οικονομικής μοχλεύσεως', values: [], hint: 24, formula: function (i) { return vm.data.totals[2].values[1] / vm.data.totals[6].values[i] } },
			{ title: 'Δείκτης αποδοτικότητας ιδίων κεφαλαίων', hint: 25, values: [], formula: function (i) { return vm.data.totals[2].values[i] / vm.data.totals[6].values[i] } },
			{ title: 'Δείκτης αποδοτικότητας ενεργητικού', hint: 26, values: [], formula: function (i) { return (vm.data.totals[2].values[i] / vm.data.totals[1].values[i]) * 100 } }
        ]
		vm.numbers = [
			{
				label: "0",
				value: 1
			},
			{
				label: "1",
				value: 1.1
			},
			{
				label: "2",
				value: 2
			},
			{
				label: "3",
				value: 3.1
			},
			{
				label: "4",
				value: 3.2
			},
			{
				label: "5",
				value: 5.1
			},
			{
				label: "6",
				value: 5.2
			},
			{
				label: "7",
				value: 7.1
			},
			{
				label: "8",
				value: 7.2
			},
			{
				label: "9",
				value: 7.3
			},
			{
				label: "10",
				value: 7.4
			},
			{
				label: "Άνω των 10",
				value: 7.5
			}
		];
	}
})();

